import React from 'react';

const Blogs = () => {
    return (
        <div className='p-4'>
             <p>(১)কনটেক্সট API কি?</p>
            <p>কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট স্ট্রাকচার যা আপনাকে অনন্য বিবরণ আদান-প্রদান করতে সক্ষম করে এবং আপনার অ্যাপ্লিকেশনের সমস্ত স্তর থেকে প্রপ-ড্রিলিং সমাধানে সহায়তা করে। আমরা রিঅ্যাক্ট এ সাধারণত একটা কম্পোনেন্ট থেকে আরেকটা কম্পোনেন্ট এ ডাটা সেন্ড করি। সেক্ষেত্রে একটা কম্পোনেন্ট এর ডাটা আরেকটা চাইল্ড কম্পোনেন্ট এ প্রপস হিসাবে পাঠাতে হয়। অনেকসময় এরকম সিচুয়েশন আসে যে আমাদের মেইন কম্পোনেন্ট যেখানে আপনার ডাটা রয়েছে সেখান থেকে চাইল্ড কম্পোনেন্ট অনেক লেভেল নিচে থাকে। মানে ঐ ডাটাওয়ালা কম্পোনেন্ট এর আরেকটা চাইল্ড কম্পোনেন্ট আছে, আবার সেই চাইল্ড কম্পোনেন্ট এর আবার আরেকটা চাইল্ড কম্পোনেন্ট আছে। এভাবে করতে করতে অনেকগুলা চাইল্ড থাকতে পারে। এখন আমরা মেইন কম্পোনেন্ট বা আমরা যেটাকে বলি টপ লেভেল কম্পোনেন্ট থেকে ডাটা অনেক লেভেল নিচের কোনো চাইল্ড কম্পোনেন্ট এ নিতে চাই, তাহলে আমাদের সেই চাইল্ড কম্পোনেন্ট এর প্যারেন্ট এবং সেই প্যারেন্ট এর প্যারেন্ট এভাবে করতে করতে ডাটাওয়ালা কম্পোনেন্ট এ বা টপ লেভেল কম্পোনেন্ট পর্যন্ত সবগুলার হেল্প নিতে হবে ডাটা পাস করার জন্যে। কিন্তু এই রিঅ্যাক্ট স্ট্রাকচার যা আপনাকে অনন্য বিবরণ আদান-প্রদান করতে সক্ষম করে। </p>
        
            <p className='mt-10'>(২)সিমেন্টিক কি ?</p>
            <p>শব্দার্থিক এইচটিএমএল ট্যাগগুলি সেই ট্যাগের বিষয়বস্তু সম্পর্কে তথ্য প্রদান করে যা একটি পৃষ্ঠায় তারা যেভাবে দেখায় তার বাইরে যায়৷ ট্যাগে আবদ্ধ পাঠ্যটি অবিলম্বে ব্রাউজার দ্বারা কিছু ধরণের কোডিং ভাষা হিসাবে স্বীকৃত হয় । HTML5 শব্দার্থিক ট্যাগ উপাদানটির উদ্দেশ্য নির্ধারণ করে। শব্দার্থিক মার্কআপ ব্যবহার করে, আপনি ব্রাউজারকে শুধুমাত্র এটি প্রদর্শন করার পরিবর্তে বিষয়বস্তুর অর্থ বুঝতে সাহায্য করেন। এই অতিরিক্ত স্তরের স্পষ্টতা প্রদান করে, HTML5 শব্দার্থিক উপাদানগুলি সার্চ ইঞ্জিনগুলিকে পৃষ্ঠাটি পড়তে এবং প্রয়োজনীয় তথ্য দ্রুত খুঁজে পেতে সহায়তা করে ।</p>
        
        </div>
    );
};

export default Blogs;